const Map<String, String> homeSearchI18n = {
  'i18n_search_搜索内容': 'ค้นหาเนื้อหา...',
  'i18n_search_搜索': 'ค้นหา',
  'i18n_search_没有找到相关内容': 'ไม่พบเนื้อหาที่เกี่ยวข้อง',
  'i18n_search_开始搜索': 'เริ่มค้นหา',
  'i18n_search_试试调整关键词': 'ลองปรับคำสำคัญหรือใช้คำค้นหาอื่น',
  'i18n_search_输入关键词搜索文章标题': 'ป้อนคำสำคัญเพื่อค้นหาบทความ หัวข้อ',
  'i18n_search_找到结果': 'พบ @count ผลลัพธ์ (@durationms)',
  'i18n_search_极快': 'เร็วมาก',
  'i18n_search_快速': 'เร็ว',
  'i18n_search_较慢': 'ค่อนข้างช้า',
  'i18n_search_无内容': 'ไม่มีเนื้อหา',
}; 