// lib/basics/translations/ru_ru/guide_i18n.dart

const Map<String, String> guideI18n = {
  'i18n_guide_跳过': 'Пропустить',
  'i18n_guide_智能收藏': 'Умная Коллекция',
  'i18n_guide_随时随地收集有价值的内容支持分享链接方式进行收藏您感兴趣的内容让知识不再丢失': 'Собирайте ценный контент в любое время и в любом месте\nПоддерживает обмен и ссылки для сохранения интересующего вас контента\nЧтобы знания больше не терялись',
  'i18n_guide_分类整理': 'Категоризация и Организация',
  'i18n_guide_智能分类管理你的收藏标签文件夹多维度组织快速找到所需内容': 'Умно управляйте своими коллекциями\nМногомерная организация с тегами и папками\nБыстро находите то, что вам нужно',
  'i18n_guide_深度阅读': 'Глубокое Чтение',
  'i18n_guide_专注的阅读体验支持标注笔记翻译让阅读更有价值': 'Сосредоточенный опыт чтения\nПоддерживает аннотации, заметки и перевод\nДелая чтение более ценным',
  'i18n_guide_开始使用': 'Начать',
  'i18n_guide_下一步': 'Далее',
}; 