// Copyright (c) 2025 Clipora.
//
// This work is licensed under the Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International License.
// To view a copy of this license, visit http://creativecommons.org/licenses/by-nc-nd/4.0/



const Map<String, String> guideI18n = {
  'i18n_guide_跳过': 'Пропустить',
  'i18n_guide_智能收藏': 'Умная Коллекция',
  'i18n_guide_随时随地收集有价值的内容支持分享链接方式进行收藏您感兴趣的内容让知识不再丢失': 'Собирайте ценный контент в любое время и в любом месте\nПоддерживает обмен и ссылки для сохранения интересующего вас контента\nЧтобы знания больше не терялись',
  'i18n_guide_分类整理': 'Категоризация и Организация',
  'i18n_guide_智能分类管理你的收藏标签文件夹多维度组织快速找到所需内容': 'Умно управляйте своими коллекциями\nМногомерная организация с тегами и папками\nБыстро находите то, что вам нужно',
  'i18n_guide_深度阅读': 'Глубокое Чтение',
  'i18n_guide_专注的阅读体验支持标注笔记翻译让阅读更有价值': 'Сосредоточенный опыт чтения\nПоддерживает аннотации, заметки и перевод\nДелая чтение более ценным',
  'i18n_guide_开始使用': 'Начать',
  'i18n_guide_下一步': 'Далее',
  
  // Тексты, связанные с руководством
  'i18n_guide_如何收藏': 'Как собирать?',
  'i18n_guide_在其他应用中点击分享': 'В других приложениях нажмите поделиться',
  'i18n_guide_点击Clipora图标即可收藏': 'Нажмите на значок Clipora, чтобы собрать',
  'i18n_guide_点击图片继续': 'Нажмите на изображение, чтобы продолжить',
  'i18n_guide_点击分享图标继续': 'Нажмите на значок поделиться, чтобы продолжить',
  'i18n_guide_点击Clipora图标继续': 'Нажмите на значок Clipora, чтобы продолжить',
  'i18n_guide_继续': 'Продолжить',
  'i18n_guide_我知道了': 'Понятно',
}; 