const Map<String, String> homeIndexI18n = {
  'i18n_home_首页': 'Главная',
  'i18n_home_分组': 'Группы',
  'i18n_home_正在初始化': 'Инициализация...', 
  'i18n_home_正在初始化同步': 'Инициализация синхронизации...', 
  'i18n_home_正在完成同步': 'Завершение синхронизации...', 
  'i18n_home_同步完成': 'Синхронизация завершена!', 
  'i18n_home_同步失败请检查网络连接后重试': 'Синхронизация не удалась, проверьте сетевое подключение и повторите попытку', 
  'i18n_home_同步异常': 'Ошибка синхронизации: ', 
  'i18n_home_最近阅读': 'Недавно прочитанное', 
  'i18n_home_暂无最近阅读记录': 'Нет записей недавнего чтения', 
  'i18n_home_我的标签': 'Мои теги', 
  'i18n_home_标签': 'Тег: ', 
  'i18n_home_稍后阅读': 'Читать позже', 
  'i18n_home_共count篇': 'Всего @count статей',
  'i18n_home_暂无需要稍后阅读的文章': 'Нет статей для чтения позже',

  // upgrade_dialog
  'i18n_upgrade_发现新版本': 'Найдена новая версия @version',
  'i18n_upgrade_我们建议您升级到最新版本': 'Мы рекомендуем обновиться до последней версии для лучшего опыта.',
  'i18n_upgrade_更新内容': 'Содержимое обновления:',
  'i18n_upgrade_稍后提醒': 'Напомнить позже',
  'i18n_upgrade_立即更新': 'Обновить сейчас',

  // add_content_dialog
  'i18n_addContent_手动添加的链接': 'Вручную добавленная ссылка',
  'i18n_addContent_该链接已存在': 'Эта ссылка уже существует',
  'i18n_addContent_添加失败请重试': 'Не удалось добавить, попробуйте еще раз',
  'i18n_addContent_链接添加成功': 'Ссылка успешно добавлена',
  'i18n_addContent_文本添加成功': 'Текст успешно добавлен',
  'i18n_addContent_添加内容': 'Добавить содержимое',
  'i18n_addContent_请输入包含链接的文本': 'Пожалуйста, введите текст со ссылками, система автоматически их распознает',
  'i18n_addContent_粘贴包含链接的文本内容': 'Вставьте текстовое содержимое со ссылками...\n\nПоддерживаемые форматы ссылок:\n• https://example.com\n• www.example.com\n• baidu.com',
  'i18n_addContent_内容中未检测到有效链接': 'В содержимом не обнаружено действительных ссылок',
  'i18n_addContent_检测到链接': 'Ссылка обнаружена',
  'i18n_addContent_取消': 'Отменить',
  'i18n_addContent_添加': 'Добавить',

  // build_sync_dialog
  'i18n_sync_数据同步中': 'Синхронизация данных',
  'i18n_sync_正在同步': 'Синхронизация...', 
  'i18n_sync_新设备正在同步数据': 'Новое устройство синхронизирует данные, пожалуйста, поддерживайте сетевое подключение',

  // permission_dialog
  'i18n_permission_请求存储文件权限': 'Запрос разрешения на хранение файлов',
  'i18n_permission_存储文件权限说明': 'Во время использования нам нужно получить ваше разрешение на хранение файлов. Мы будем кешировать веб-страницы в вашем локальном хранилище.',
  'i18n_permission_不同意': 'Не согласен',
  'i18n_permission_同意': 'Согласен',
}; 