// lib/basics/translations/zh_cn/guide_i18n.dart

const Map<String, String> guideI18n = {
  'i18n_guide_跳过': '跳过',
  'i18n_guide_智能收藏': '智能收藏',
  'i18n_guide_随时随地收集有价值的内容支持分享链接方式进行收藏您感兴趣的内容让知识不再丢失': '随时随地收集有价值的内容\n支持分享、链接方式进行收藏您感兴趣的内容\n让知识不再丢失',
  'i18n_guide_分类整理': '分类整理',
  'i18n_guide_智能分类管理你的收藏标签文件夹多维度组织快速找到所需内容': '智能分类管理你的收藏\n标签、文件夹多维度组织\n快速找到所需内容',
  'i18n_guide_深度阅读': '深度阅读',
  'i18n_guide_专注的阅读体验支持标注笔记翻译让阅读更有价值': '专注的阅读体验\n支持标注、笔记、翻译\n让阅读更有价值',
  'i18n_guide_开始使用': '开始使用',
  'i18n_guide_下一步': '下一步',
};