class ZhCN {
  static const Map<String, String> translations = {
    
    // 内容语言 - 简短标签
    'i18n_内容语言_原文': '原文',
    'i18n_内容语言_中文': '中文',
    'i18n_内容语言_繁体中文': '繁体中文',
    'i18n_内容语言_英文': '英文',
    'i18n_内容语言_日文': '日文',
    'i18n_内容语言_韩文': '韩文',
    'i18n_内容语言_法文': '法文',
    'i18n_内容语言_德文': '德文',
    'i18n_内容语言_西班牙文': '西班牙文',
    'i18n_内容语言_俄文': '俄文',
    'i18n_内容语言_阿拉伯文': '阿拉伯文',
    'i18n_内容语言_葡萄牙文': '葡萄牙文',
    'i18n_内容语言_意大利文': '意大利文',
    'i18n_内容语言_荷兰文': '荷兰文',
    'i18n_内容语言_泰文': '泰文',
    'i18n_内容语言_越南文': '越南文',
    
    // 内容语言 - 完整名称
    'i18n_内容语言_原文_完整': '原始语言',
    'i18n_内容语言_中文_完整': '简体中文',
    'i18n_内容语言_繁体中文_完整': '繁体中文',
    'i18n_内容语言_英文_完整': '英语',
    'i18n_内容语言_日文_完整': '日语',
    'i18n_内容语言_韩文_完整': '韩语',
    'i18n_内容语言_法文_完整': '法语',
    'i18n_内容语言_德文_完整': '德语',
    'i18n_内容语言_西班牙文_完整': '西班牙语',
    'i18n_内容语言_俄文_完整': '俄语',
    'i18n_内容语言_阿拉伯文_完整': '阿拉伯语',
    'i18n_内容语言_葡萄牙文_完整': '葡萄牙语',
    'i18n_内容语言_意大利文_完整': '意大利语',
    'i18n_内容语言_荷兰文_完整': '荷兰语',
    'i18n_内容语言_泰文_完整': '泰语',
    'i18n_内容语言_越南文_完整': '越南语',
    

  };
} 