// lib/basics/translations/ko_kr/guide_i18n.dart

const Map<String, String> guideI18n = {
  'i18n_guide_跳过': '건너뛰기',
  'i18n_guide_智能收藏': '스마트 컬렉션',
  'i18n_guide_随时随地收集有价值的内容支持分享链接方式进行收藏您感兴趣的内容让知识不再丢失': '언제 어디서나 가치 있는 콘텐츠를 수집\n공유와 링크를 통해 관심 있는 콘텐츠를 저장\n지식이 더 이상 사라지지 않도록',
  'i18n_guide_分类整理': '분류 정리',
  'i18n_guide_智能分类管理你的收藏标签文件夹多维度组织快速找到所需内容': '컬렉션을 지능적으로 관리\n태그와 폴더로 다차원 정리\n필요한 콘텐츠를 빠르게 찾기',
  'i18n_guide_深度阅读': '깊이 있는 읽기',
  'i18n_guide_专注的阅读体验支持标注笔记翻译让阅读更有价值': '집중할 수 있는 읽기 경험\n주석, 메모, 번역 지원\n읽기를 더 가치 있게 만들기',
  'i18n_guide_开始使用': '시작하기',
  'i18n_guide_下一步': '다음',
  
  // 튜토리얼 가이드 관련 텍스트
  'i18n_guide_如何收藏': '수집 방법?',
  'i18n_guide_在其他应用中点击分享': '다른 앱에서 공유 탭',
  'i18n_guide_点击Clipora图标即可收藏': 'Clipora 아이콘을 탭하여 수집',
  'i18n_guide_点击图片继续': '이미지를 탭하여 계속',
  'i18n_guide_继续': '계속',
  'i18n_guide_我知道了': '알겠습니다',
}; 