// lib/basics/translations/ar_ar/guide_i18n.dart

const Map<String, String> guideI18n = {
  'i18n_guide_跳过': 'تخطي',
  'i18n_guide_智能收藏': 'مجموعة ذكية',
  'i18n_guide_随时随地收集有价值的内容支持分享链接方式进行收藏您感兴趣的内容让知识不再丢失': 'اجمع المحتوى القيم في أي وقت وأي مكان\nيدعم المشاركة والروابط لحفظ المحتوى الذي يهمك\nحتى لا تضيع المعرفة بعد الآن',
  'i18n_guide_分类整理': 'تصنيف وتنظيم',
  'i18n_guide_智能分类管理你的收藏标签文件夹多维度组织快速找到所需内容': 'إدارة مجموعاتك بذكاء\nتنظيم متعدد الأبعاد مع العلامات والمجلدات\nاعثر بسرعة على ما تحتاجه',
  'i18n_guide_深度阅读': 'قراءة عميقة',
  'i18n_guide_专注的阅读体验支持标注笔记翻译让阅读更有价值': 'تجربة قراءة مركزة\nيدعم التعليقات والملاحظات والترجمة\nيجعل القراءة أكثر قيمة',
  'i18n_guide_开始使用': 'ابدأ الاستخدام',
  'i18n_guide_下一步': 'التالي',
  
  // نصوص مرتبطة بدليل البرنامج التعليمي
  'i18n_guide_如何收藏': 'كيف نجمع؟',
  'i18n_guide_在其他应用中点击分享': 'في التطبيقات الأخرى، اضغط على مشاركة',
  'i18n_guide_点击Clipora图标即可收藏': 'اضغط على رمز Clipora للجمع',
  'i18n_guide_点击图片继续': 'اضغط على الصورة للمتابعة',
  'i18n_guide_点击分享图标继续': 'اضغط على رمز المشاركة للمتابعة',
  'i18n_guide_点击Clipora图标继续': 'اضغط على رمز Clipora للمتابعة',
  'i18n_guide_继续': 'متابعة',
  'i18n_guide_我知道了': 'فهمت',
}; 