// lib/basics/translations/ja_jp/guide_i18n.dart

const Map<String, String> guideI18n = {
  'i18n_guide_跳过': 'スキップ',
  'i18n_guide_智能收藏': 'スマートコレクション',
  'i18n_guide_随时随地收集有价值的内容支持分享链接方式进行收藏您感兴趣的内容让知识不再丢失': 'いつでもどこでも価値のあるコンテンツを収集\n共有やリンクを通じて興味のあるコンテンツを保存\n知識を失わないように',
  'i18n_guide_分类整理': 'カテゴリ整理',
  'i18n_guide_智能分类管理你的收藏标签文件夹多维度组织快速找到所需内容': 'コレクションをインテリジェントに管理\nタグやフォルダで多次元的に整理\n必要なコンテンツを素早く見つける',
  'i18n_guide_深度阅读': '深い読書',
  'i18n_guide_专注的阅读体验支持标注笔记翻译让阅读更有价值': '集中できる読書体験\n注釈、メモ、翻訳をサポート\n読書をより価値のあるものに',
  'i18n_guide_开始使用': '使い始める',
  'i18n_guide_下一步': '次へ',
}; 