const Map<String, String> homeIndexI18n = {
  'i18n_home_首页': 'ホーム',
  'i18n_home_分组': 'グループ',
  'i18n_home_正在初始化': '初期化中...', 
  'i18n_home_正在初始化同步': '同期初期化中...', 
  'i18n_home_正在完成同步': '同期完了中...', 
  'i18n_home_同步完成': '同期完了！', 
  'i18n_home_同步失败请检查网络连接后重试': '同期失敗しました。ネットワーク接続を確認して再試行してください', 
  'i18n_home_同步异常': '同期異常: ', 
  'i18n_home_最近阅读': '最近読んだ記事', 
  'i18n_home_暂无最近阅读记录': '最近の読書記録がありません', 
  'i18n_home_我的标签': 'マイタグ', 
  'i18n_home_标签': 'タグ: ', 
  'i18n_home_稍后阅读': '新しいコンテンツ',
  'i18n_home_共count篇': '合計 @count 件',
  'i18n_home_暂无需要稍后阅读的文章': '新しいコンテンツがありません',

  // upgrade_dialog
  'i18n_upgrade_发现新版本': '新バージョン @version が見つかりました',
  'i18n_upgrade_我们建议您升级到最新版本': 'より良い体験のために、最新バージョンにアップグレードすることをお勧めします。',
  'i18n_upgrade_更新内容': '更新内容:',
  'i18n_upgrade_稍后提醒': '後で通知',
  'i18n_upgrade_立即更新': '今すぐ更新',

  // add_content_dialog
  'i18n_addContent_手动添加的链接': '手動追加されたリンク',
  'i18n_addContent_该链接已存在': 'このリンクは既に存在します',
  'i18n_addContent_添加失败请重试': '追加に失敗しました。再試行してください',
  'i18n_addContent_链接添加成功': 'リンクの追加に成功しました',
  'i18n_addContent_文本添加成功': 'テキストの追加に成功しました',
  'i18n_addContent_添加内容': 'コンテンツを追加',
  'i18n_addContent_请输入包含链接的文本': 'リンクを含むテキストを入力してください。システムが自動的に認識します',
  'i18n_addContent_粘贴包含链接的文本内容': 'リンクを含むテキストコンテンツを貼り付けてください...\n\nサポートされているリンク形式：\n• https://example.com\n• www.example.com\n• baidu.com',
  'i18n_addContent_内容中未检测到有效链接': 'コンテンツ内に有効なリンクが検出されませんでした',
  'i18n_addContent_检测到链接': 'リンクを検出しました',
  'i18n_addContent_取消': 'キャンセル',
  'i18n_addContent_添加': '追加',

  // build_sync_dialog
  'i18n_sync_数据同步中': 'データ同期中',
  'i18n_sync_正在同步': '同期中...', 
  'i18n_sync_新设备正在同步数据': '新しいデバイスがデータを同期中です。ネットワーク接続を維持してください',

  // permission_dialog
  'i18n_permission_请求存储文件权限': 'ファイル保存権限の要求',
  'i18n_permission_存储文件权限说明': 'ご利用中に、ファイル保存権限を取得する必要があります。ウェブページをローカルストレージにキャッシュします。',
  'i18n_permission_不同意': '同意しない',
  'i18n_permission_同意': '同意する',

  // 0727
  'i18n_permission_可在设置中开或关闭自动解析': '設定で自動解析のオン・オフを切り替えできます',
  'i18n_permission_去设置': '設定へ',
}; 